[Killed] Linq method mutation (All() to Any())
Board.cs:16:36
             Positions = positions;
         }
 
-        public bool IsConquered => Positions
-            .Select(position => position.Occupant)
-            .Where(occupant => occupant != null)
-            .All(occupant => occupant.IsSunk);
+        public bool IsConquered => Positions
+            .Select(position => position.Occupant)
+            .Where(occupant => occupant != null)
+            .Any(occupant => occupant.IsSunk);
 
         public virtual ShotResult Check(Coordinates coordinates)

[Killed] Equality mutation
Board.cs:18:32
 
         public bool IsConquered => Positions
             .Select(position => position.Occupant)
-            .Where(occupant => occupant != null)
+            .Where(occupant => occupant == null)
             .All(occupant => occupant.IsSunk);
 

[Killed] Negate expression
Board.cs:26:17
             var position = GetPosition(coordinates);
             position.MarkAsChecked();
 
-            if (position.IsOccupied)
+            if (!(position.IsOccupied))
             {
                 return new ShotResult(position.Occupant);

[Survived] Linq method mutation (Single() to SingleOrDefault())
Board.cs:36:20
 
         private Position GetPosition(Coordinates coordinates)
         {
-            return Positions.Single(position =>
-                position.Coordinates.Horizontal == coordinates.Horizontal &&
-                position.Coordinates.Vertical == coordinates.Vertical);
+            return Positions.SingleOrDefault(position =>
+                position.Coordinates.Horizontal == coordinates.Horizontal &&
+                position.Coordinates.Vertical == coordinates.Vertical);
         }
     }

[Killed] Logical mutation
Board.cs:37:17
         private Position GetPosition(Coordinates coordinates)
         {
             return Positions.Single(position =>
-                position.Coordinates.Horizontal == coordinates.Horizontal &&
-                position.Coordinates.Vertical == coordinates.Vertical);
+                                position.Coordinates.Horizontal == coordinates.Horizontal ||
+                position.Coordinates.Vertical == coordinates.Vertical);
         }
     }

[Killed] Equality mutation
Board.cs:37:17
         private Position GetPosition(Coordinates coordinates)
         {
             return Positions.Single(position =>
-                position.Coordinates.Horizontal == coordinates.Horizontal &&
+                                position.Coordinates.Horizontal != coordinates.Horizontal  &&
                 position.Coordinates.Vertical == coordinates.Vertical);
         }

[Killed] Equality mutation
Board.cs:38:17
         {
             return Positions.Single(position =>
                 position.Coordinates.Horizontal == coordinates.Horizontal &&
-                position.Coordinates.Vertical == coordinates.Vertical);
+                                position.Coordinates.Vertical != coordinates.Vertical);
         }
     }
