[Killed] Equality mutation
Position.cs:8:35
     internal class Position
     {
         public Coordinates Coordinates { get; }
-        public bool IsOccupied => Occupant != null;
+        public bool IsOccupied => Occupant == null;
         public Ship Occupant { get; }
         public PositionState State { get; private set; }

[Killed] Negate expression
Position.cs:21:17
 
         public virtual void MarkAsChecked()
         {
-            if (!IsOccupied)
+            if (!(!IsOccupied))
             {
                 State = PositionState.Miss;

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Position.cs:21:17
 
         public virtual void MarkAsChecked()
         {
-            if (!IsOccupied)
+            if (IsOccupied)
             {
                 State = PositionState.Miss;

[Killed] Negate expression
Position.cs:27:17
                 return;
             }
                 
-            if (State == PositionState.Unchecked)
+            if (!(State == PositionState.Unchecked))
             {
                 Occupant.ReportHit();

[Killed] Equality mutation
Position.cs:27:17
                 return;
             }
                 
-            if (State == PositionState.Unchecked)
+            if (State != PositionState.Unchecked)
             {
                 Occupant.ReportHit();
