[Killed] Negate expression
RandomPositioner.cs:5:21
 using System.Collections.Generic;
 
 namespace Battleships.Core
-{
+{!(                    isHorizontallyOriented )
     internal class RandomPositioner
     {

[Killed] Equality mutation
RandomPositioner.cs:19:17
 
         public virtual List<Position> GeneratePositionsForShip(Ship ship)
         {
-            if (ship.NumberOfMasts > _boardSize)
+            if (ship.NumberOfMasts < _boardSize)
             {
                 throw new ArgumentException("Ship cannot be bigger than the board");

[Killed] Negate expression
RandomPositioner.cs:19:17
 
         public virtual List<Position> GeneratePositionsForShip(Ship ship)
         {
-            if (ship.NumberOfMasts > _boardSize)
+            if (!(ship.NumberOfMasts > _boardSize))
             {
                 throw new ArgumentException("Ship cannot be bigger than the board");

[Killed] String mutation
RandomPositioner.cs:21:45
         {
             if (ship.NumberOfMasts > _boardSize)
             {
-                throw new ArgumentException("Ship cannot be bigger than the board");
+                throw new ArgumentException("");
             }
 

[Killed] Arithmetic mutation
RandomPositioner.cs:25:90
             }
 
             var isHorizontallyOriented = _randomGenerator.GenerateRandomBool();
-            var boardFittingInitialCoordinate = _randomGenerator.GenerateRandomNumber(0, _boardSize - 1);
+            var boardFittingInitialCoordinate = _randomGenerator.GenerateRandomNumber(0, _boardSize + 1);
             var shipFittingInitialCoordinate = _randomGenerator.GenerateRandomNumber(0, _boardSize - 1 - ship.NumberOfMasts);
 

[Killed] Arithmetic mutation
RandomPositioner.cs:26:89
 
             var isHorizontallyOriented = _randomGenerator.GenerateRandomBool();
             var boardFittingInitialCoordinate = _randomGenerator.GenerateRandomNumber(0, _boardSize - 1);
-            var shipFittingInitialCoordinate = _randomGenerator.GenerateRandomNumber(0, _boardSize - 1 - ship.NumberOfMasts);
+            var shipFittingInitialCoordinate = _randomGenerator.GenerateRandomNumber(0, _boardSize + 1  - ship.NumberOfMasts);
 
             var positions = new List<Position>();

[Killed] Arithmetic mutation
RandomPositioner.cs:26:89
 
             var isHorizontallyOriented = _randomGenerator.GenerateRandomBool();
             var boardFittingInitialCoordinate = _randomGenerator.GenerateRandomNumber(0, _boardSize - 1);
-            var shipFittingInitialCoordinate = _randomGenerator.GenerateRandomNumber(0, _boardSize - 1 - ship.NumberOfMasts);
+            var shipFittingInitialCoordinate = _randomGenerator.GenerateRandomNumber(0, _boardSize - 1 + ship.NumberOfMasts);
 
             var positions = new List<Position>();

[Killed] Equality mutation
RandomPositioner.cs:30:56
 
             var positions = new List<Position>();
 
-            for (var i = shipFittingInitialCoordinate; i < ship.NumberOfMasts + shipFittingInitialCoordinate; i++)
+            for (var i = shipFittingInitialCoordinate; i <= ship.NumberOfMasts + shipFittingInitialCoordinate; i++)
             {
                 positions.Add(

[Killed] Equality mutation
RandomPositioner.cs:30:56
 
             var positions = new List<Position>();
 
-            for (var i = shipFittingInitialCoordinate; i < ship.NumberOfMasts + shipFittingInitialCoordinate; i++)
+            for (var i = shipFittingInitialCoordinate; i > ship.NumberOfMasts + shipFittingInitialCoordinate; i++)
             {
                 positions.Add(
