[Killed] Equality mutation
Ship.cs:8:33
     public class Ship
     {
         public int NumberOfMasts { get; }
-        internal bool IsSunk => _hitMastsCount == NumberOfMasts;
+        internal bool IsSunk => _hitMastsCount != NumberOfMasts;
         internal virtual void ReportHit() => _hitMastsCount++;
 

[Killed] Negate expression
Ship.cs:15:17
 
         public Ship(int numberOfMasts)
         {
-            if (numberOfMasts == 0) throw new ArgumentException("Ship must have at least one mast.");
+            if (!(numberOfMasts == 0)) throw new ArgumentException("Ship must have at least one mast.");
 
             NumberOfMasts = numberOfMasts;

[Killed] Equality mutation
Ship.cs:15:17
 
         public Ship(int numberOfMasts)
         {
-            if (numberOfMasts == 0) throw new ArgumentException("Ship must have at least one mast.");
+            if (numberOfMasts != 0) throw new ArgumentException("Ship must have at least one mast.");
 
             NumberOfMasts = numberOfMasts;
