[Timeout] Negate expression
ShipPositioner.cs:42:19
         {
             var generatedPositions = _randomPositioner.GeneratePositionsForShip(ship);
 
-            while(AreShipsColliding(generatedPositions, positions))
+            while(!(AreShipsColliding(generatedPositions, positions)))
             {
                 generatedPositions.Clear();

[Timeout] Linq method mutation (Any() to All())
ShipPositioner.cs:53:20
 
         private bool AreShipsColliding(List<Position> generatedPositions, List<Position> positions)
         {
-            return generatedPositions.Any(position => AreTooClose(position.Coordinates, positions));
+            return generatedPositions.All(position => AreTooClose(position.Coordinates, positions));
         }
 

[Killed] Linq method mutation (Any() to All())
ShipPositioner.cs:60:20
         {
             const int minimumOffset = 1;
 
-            return alreadyTakenPositions.Any(takenPosition =>
-                Math.Abs(takenPosition.Coordinates.Horizontal - coordinates.Horizontal) <= minimumOffset &&
-                Math.Abs(takenPosition.Coordinates.Vertical - coordinates.Vertical) <= minimumOffset);
+            return alreadyTakenPositions.All(takenPosition =>
+                Math.Abs(takenPosition.Coordinates.Horizontal - coordinates.Horizontal) <= minimumOffset &&
+                Math.Abs(takenPosition.Coordinates.Vertical - coordinates.Vertical) <= minimumOffset);
         }
     }

[Killed] Logical mutation
ShipPositioner.cs:61:17
             const int minimumOffset = 1;
 
             return alreadyTakenPositions.Any(takenPosition =>
-                Math.Abs(takenPosition.Coordinates.Horizontal - coordinates.Horizontal) <= minimumOffset &&
-                Math.Abs(takenPosition.Coordinates.Vertical - coordinates.Vertical) <= minimumOffset);
+                                Math.Abs(takenPosition.Coordinates.Horizontal - coordinates.Horizontal) <= minimumOffset ||
+                Math.Abs(takenPosition.Coordinates.Vertical - coordinates.Vertical) <= minimumOffset);
         }
     }

[Killed] Arithmetic mutation
ShipPositioner.cs:61:26
             const int minimumOffset = 1;
 
             return alreadyTakenPositions.Any(takenPosition =>
-                Math.Abs(takenPosition.Coordinates.Horizontal - coordinates.Horizontal) <= minimumOffset &&
+                Math.Abs(takenPosition.Coordinates.Horizontal + coordinates.Horizontal) <= minimumOffset &&
                 Math.Abs(takenPosition.Coordinates.Vertical - coordinates.Vertical) <= minimumOffset);
         }

[Killed] Equality mutation
ShipPositioner.cs:62:17
 
             return alreadyTakenPositions.Any(takenPosition =>
                 Math.Abs(takenPosition.Coordinates.Horizontal - coordinates.Horizontal) <= minimumOffset &&
-                Math.Abs(takenPosition.Coordinates.Vertical - coordinates.Vertical) <= minimumOffset);
+                                Math.Abs(takenPosition.Coordinates.Vertical - coordinates.Vertical) < minimumOffset);
         }
     }

[Killed] Arithmetic mutation
ShipPositioner.cs:62:26
 
             return alreadyTakenPositions.Any(takenPosition =>
                 Math.Abs(takenPosition.Coordinates.Horizontal - coordinates.Horizontal) <= minimumOffset &&
-                Math.Abs(takenPosition.Coordinates.Vertical - coordinates.Vertical) <= minimumOffset);
+                Math.Abs(takenPosition.Coordinates.Vertical + coordinates.Vertical) <= minimumOffset);
         }
     }
