[Killed] Equality mutation
ShotResult.cs:5:30
 {
     public class ShotResult
     {
-        public bool IsHit => Ship != null;
+        public bool IsHit => Ship == null;
         public Ship Ship { get; }
 
